app/controllers/links_controller.rb

  def create
    @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save
---
INSERT INTO "links" ("title", "url", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Google"], ["url", "http://www.google.com"], ["created_at", 2017-02-01 18:56:08 UTC], ["updated_at", 2017-02-01 18:56:08 UTC], ["user_id", 1]]

  def upvote
    @link = Link.find(params[:id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]